Repository: hamaup/LinguaSafeTrip
Catalog: frontend/lib/l10n/app_*.arb
Languages: es, ja, ko

# earthquakeOverview
source: Strong earthquake activity detected. Take cover under a sturdy desk or table. Stay away from falling objects and prepare for potential aftershocks.
ja: 強い地震活動が検出されました。机の下に隠れるなど安全を確保してください。落下物から身を守り、余震に備えてください。

# tsunamiOverview
source: Tsunami warning has been issued. Evacuate to higher ground immediately. Do not approach the coast and follow evacuation instructions.
ja: 津波警報が発表されました。直ちに高台に避難してください。海岸には近づかず、避難指示に従ってください。

# fireOverview
source: Fire alert has been detected. Evacuate the building immediately using stairs, not elevators. Stay low to avoid smoke inhalation.
ja: 火災が発生しています。エレベーターは使わず階段で速やかに避難してください。煙の吸入を避けるため低い姿勢を保ってください。

# typhoonOverview
source: Typhoon is approaching. Stay indoors, secure windows, and avoid flooded areas. Prepare for power outages and water service disruptions.
ja: 台風が接近しています。外出を控え、窓ガラスを補強してください。浸水危険地域では早期避難し、停電・断水に備えてください。

# floodOverview
source: Flood warning is in effect. Move to higher ground immediately. Avoid walking or driving through flood water. Monitor emergency broadcasts.
ja: 洪水警報が発表されています。直ちに高台に避難してください。冠水した道路の歩行・運転は避け、緊急放送を確認してください。

# volcanicOverview
source: Volcanic activity has increased. Beware of volcanic ash and projectiles. Stay away from designated evacuation zones and cover nose and mouth.
ja: 火山活動が活発化しています。火山灰や噴石に注意し、指定された避難区域から離れてください。マスクやタオルで口鼻を覆い、火山灰の吸入を防いでください。

# landslideOverview
source: Landslide risk has increased. Stay away from mountainous areas and steep slopes. Watch for warning signs like springs and ground rumbling.
ja: 土砂災害の危険があります。山際や急傾斜地から離れ、安全な場所に避難してください。前兆現象（湧水・地鳴り等）に注意し、早めの避難を心がけてください。

# tornadoOverview
source: Tornado activity detected. Take shelter in a sturdy building away from windows. If outdoors, lie flat in a low area and protect yourself from flying debris.
ja: 竜巻が発生する可能性があります。頑丈な建物の中に避難し、窓から離れてください。屋外にいる場合は低い場所に身を伏せ、飛来物から身を守ってください。

# earthquakeActions
source: 1. Ensure personal safety first 2. Take cover under desk or table 3. Extinguish fires and secure escape routes 4. Gather accurate information
ja: 1. 身の安全を最優先に確保 2. 机の下に隠れる等の安全行動 3. 火の始末と避難経路確保 4. 正確な情報収集

# tsunamiActions
source: 1. Evacuate to higher ground immediately 2. Avoid vehicle evacuation 3. Stay away from coast until warning is lifted 4. Follow evacuation orders
ja: 1. 直ちに高台へ避難 2. 車での避難は避ける 3. 津波警報解除まで海岸に近づかない 4. 避難指示に従う

# fireActions
source: 1. Stay low to avoid smoke 2. Secure exit and evacuate quickly 3. Do not use elevators 4. Call emergency services
ja: 1. 煙を吸わないよう低い姿勢で 2. 出口を確保して速やかに避難 3. エレベーター使用禁止 4. 119番通報

# typhoonActions
source: 1. Stay indoors 2. Reinforce windows 3. Early evacuation from flood-prone areas 4. Prepare for power and water outages
ja: 1. 外出を控える 2. 窓ガラスの補強 3. 浸水危険地域は早期避難 4. 停電・断水に備える

# defaultEmergencyActions
source: 1. Stay calm and assess situation 2. Move to safe location 3. Gather accurate information 4. Prepare for evacuation
ja: 1. 落ち着いて状況を確認 2. 安全な場所に移動 3. 正確な情報を収集 4. 避難準備を整える

source: Emergency Actions
ja: 緊急時の対応

# emergencyContactSetupSubtitle
source: Register people to contact during disasters
ja: 災害時に連絡する人を登録

# nicknameSetupSubtitle
source: Set your display name
ja: あなたの呼び名を設定

source: Nearby Shelters
ja: 近くの避難所

# shelterCount
source: {count} shelters
ja: {count}件の避難所

# safetySmsDefaultMessage
source: I am safe. Location: {location}
ja: 私は無事です。現在地: {location}

# emergencyContactRequiredTitle
source: Emergency Contacts Required
ja: 緊急連絡先が必要です

# emergencyContactRequiredMessage
source: Please register emergency contacts first.
ja: 先に緊急連絡先を登録してください。

source: Select Contacts
ja: 連絡先を選択

source: Send
ja: 送信

source: SMS sent successfully
ja: SMSを送信しました

# smsFailedToSend
source: Failed to send SMS
ja: SMS送信に失敗しました

source: Send Safety SMS
ja: 安否確認SMSを送信

source: Step 1: Select Recipients
ja: ステップ1: 送信先を選択

source: Step 2: Edit Message
ja: ステップ2: メッセージを編集

source: Select Template
ja: テンプレートを選択

# editSmsMessage
source: Edit your SMS message...
ja: SMSメッセージを編集...

# aiResponseDisclaimer
source: ※ AI responses may contain uncertainties. Please verify with official sources during emergencies.
es: ※ Las respuestas de IA pueden contener incertidumbres. Verifique con fuentes oficiales durante emergencias.
ja: ※ AI の回答には不確実性が含まれる場合があります。緊急時は公式情報源もご確認ください。
ko: ※ 답변에는 불확실성이 포함될 수 있습니다. 응급 상황에서는 공식 정보원을 확인하세요.

# selectAtLeastOneContact
source: Please select at least one contact
ja: 連絡先を1つ以上選択してください

source: Message cannot be empty
ja: メッセージは空にできません

source: Include Location
ja: 位置情報を含める

source: contacts selected
ja: 件の連絡先を選択

source: Recommended
ja: 推奨

source: Detailed
ja: 詳細

source: Check In
ja: 安否確認

# smsPartialSuccess
source: Partially Sent
ja: 一部送信完了

# smsFailed
source: Failed to Send
ja: 送信失敗

# successCount
source: {count} messages sent successfully
ja: {count}件のメッセージを送信しました

# failedCount
source: {count} messages failed to send
ja: {count}件のメッセージが送信に失敗しました

source: Suggestion deleted
ja: 提案を削除しました

source: Hazard map URL not found
ja: ハザードマップのURLが見つかりません

source: To
ja: 宛先

source: Safety Confirmation SMS
ja: 安否確認SMS

# confirmSendSms
source: Confirm SMS Send
ja: SMS送信確認

source: SMS Content Preview
ja: SMS内容プレビュー

# greeting
source: Hello
ja: こんにちは

source: Send to All
ja: 全員に送信

# loadingEmergencyInfo
source: Loading emergency information...
es: Cargando información de emergencia...
ja: 緊急情報を読み込んでいます...
ko: 긴급 정보를 로딩 중입니다...

source: I am safe.
es: Estoy a salvo.
ja: 私は無事です。
ko: 저는 안전합니다.

# voiceInputError
source: Voice input error: {error}
es: Error de entrada de voz: {error}
ja: 音声入力エラー: {error}
ko: 음성 입력 오류: {error}

# recordingSeconds
source: Recording... {seconds} seconds
es: Grabando... {seconds} segundos
ja: 録音中... {seconds}秒
ko: 녹음 중... {seconds}초

source: Sending...
es: Enviando...
ja: 送信中...
ko: 전송 중...

# locationPermissionEnabled
source: 📍 Location permission has been enabled
es: 📍 Permiso de ubicación habilitado
ja: 📍 位置情報の許可が有効になりました
ko: 📍 위치 권한이 활성화되었습니다

# locationPermissionRequired
source: ❌ Please enable location permission Settings > Apps > SafeBeee > Location
es: ❌ Por favor habilite el permiso de ubicación Ajustes > Aplicaciones > SafeBeee > Ubicación
ja: ❌ 位置情報の許可を有効にしてください 設定 > アプリ > SafeBeee > 位置情報
ko: ❌ 위치 권한을 활성화해주세요 설정 > 앱 > SafeBeee > 위치

# locationDiagnosticPerformed
source: 🔍 Location permission diagnostic performed Please check the logs
es: 🔍 Diagnóstico de permiso de ubicación realizado Por favor revise los registros
ja: 🔍 位置情報許可の詳細診断を実行しました ログをご確認ください
ko: 🔍 위치 권한 진단이 수행되었습니다 로그를 확인해주세요

# gpsServiceDisabled
source: 📱 GPS service is disabled Please enable location services in settings
es: 📱 El servicio GPS está deshabilitado Por favor habilite los servicios de ubicación en ajustes
ja: 📱 GPS サービスが無効です 設定で位置情報サービスを有効にしてください
ko: 📱 GPS 서비스가 비활성화되어 있습니다 설정에서 위치 서비스를 활성화해주세요

# itemCount
source: {count} items
es: {count} elementos
ja: {count} 件
ko: {count} 개

# alertLevel
source: Alert Level: {level}
es: Nivel de alerta: {level}
ja: 警戒レベル: {level}
ko: 경보 단계: {level}

# announcementTime
source: Announcement Time: {time}
es: Hora del anuncio: {time}
ja: 発表時刻: {time}
ko: 발표 시간: {time}

# shelter
source: Shelter: {name}
es: Refugio: {name}
ja: 避難所: {name}
ko: 대피소: {name}

# errorSavingContact
source: Error occurred while saving: {error}
es: Error al guardar: {error}
ja: 保存中にエラーが発生しました: {error}
ko: 저장 중 오류 발생: {error}

source: OK
ko: 확인

source: Location
es: Ubicación
ko: 위치

source: Current Location
es: Ubicación actual
ko: 현재 위치

# latitude
source: Lat
ko: 위도

# longitude
source: Lng
ko: 경도

source: Accuracy
es: Precisión
ko: 정확도
