Repository: hamaup/LinguaSafeTrip
Catalog: frontend/lib/l10n/app_*.arb
Languages: es, ja, ko

# permissionRequiredTitle
source: Permission Required
es: Permiso Requerido
ja: 権限のリクエスト
ko: 권한이 필요합니다

# permissionRequestSubtitle
source: Enable app functions
es: Configurar permisos para funciones básicas de la aplicación
ja: アプリの機能を有効にする
ko: 앱 기본 기능에 필요한 권한을 설정합니다

# permissionLaterInfo
source: These permissions are important for safety features but can be set later.
es: Estos permisos son importantes para las funciones de seguridad pero se pueden configurar más tarde.
ja: これらの権限は安全機能のために重要ですが、後で設定することもできます。
ko: 이러한 권한은 안전 기능에 중요하지만 나중에 설정할 수도 있습니다.

# locationPermissionTitle
source: Location Permission
es: Permiso de Ubicación
ja: 位置情報の利用許可
ko: 위치 권한

# locationPermissionRationale
source: This app uses your location to notify you about nearby shelters and danger zones.
es: Esta aplicación utiliza su ubicación para notificarle sobre refugios cercanos y zonas de peligro.
ja: このアプリはあなたの位置情報を使用して、近くの避難所や危険区域を通知します。
ko: 이 앱은 근처 대피소와 위험 지역을 알려주기 위해 귀하의 위치를 사용합니다.

# notificationPermissionTitle
source: Notification Permission
es: Permiso de Notificaciones
ja: 通知の許可
ko: 알림 권한

# notificationPermissionRationale
source: We will send you notifications about disaster alerts and important updates.
es: Le enviaremos notificaciones sobre alertas de desastres y actualizaciones importantes.
ja: 災害発生時や重要な更新情報を通知します。
ko: 재해 경보와 중요한 업데이트에 대한 알림을 보내드립니다.

source: Next
es: Siguiente
ja: 次へ
ko: 다음

source: Settings
es: Configuración
ja: 設定
ko: 설정

source: Language
es: Idioma
ja: 言語
ko: 언어

source: Select Language
es: Seleccionar Idioma
ja: 言語を選択
ko: 언어 선택

source: Cancel
es: Cancelar
ja: キャンセル
ko: 취소

# settingsLoadFailed
source: Failed to load settings. Please try again.
es: Error al cargar la configuración. Por favor, intente de nuevo.
ja: 設定の読み込みに失敗しました。もう一度お試しください。
ko: 설정을 불러오지 못했습니다. 다시 시도해주세요.

source: Notification Settings
es: Configuración de Notificaciones
ja: 通知設定
ko: 알림 설정

# notificationSettingsDescription
source: Change app notification settings
es: Cambiar configuración de notificaciones de la aplicación
ja: アプリの通知設定を変更
ko: 앱 알림 설정 변경

# messageInputHint
source: Type a message...
es: Escriba un mensaje...
ja: メッセージを入力...
ko: 메시지 입력...

source: Listening
ja: 聞いています

source: Voice Input
ja: 音声入力

# voiceInputDescription
source: Input messages by voice
ja: 音声でメッセージを入力

source: Emergency Contacts
es: Contactos de Emergencia
ja: 緊急連絡先
ko: 비상 연락처

source: Add Emergency Contact
es: Agregar Contacto de Emergencia
ja: 緊急連絡先を追加
ko: 비상 연락처 추가

source: Name
es: Nombre
ja: 名前
ko: 이름

source: Phone Number
es: Número de Teléfono
ja: 電話番号
ko: 전화번호

source: Save
es: Guardar
ja: 保存
ko: 저장

source: Register Emergency Contact
es: Registrar Contacto de Emergencia
ja: 緊急連絡先を登録
ko: 비상 연락처 등록

source: Emergency contact added
es: Contacto de emergencia agregado
ja: 緊急連絡先を追加しました
ko: 비상 연락처가 추가되었습니다

# pleaseEnterNameAndPhone
source: Please enter name and phone number
es: Por favor ingrese nombre y número de teléfono
ja: 名前と電話番号を入力してください
ko: 이름과 전화번호를 입력해주세요

# errorOccurred
source: An error occurred
es: Ocurrió un error: {error}
ja: エラーが発生しました
ko: 오류가 발생했습니다: {error}

source: Tap for details
es: Toque para ver detalles
ja: タップして詳細
ko: 자세히 보려면 탭하세요

source: Welcome
es: Bienvenido
ja: ようこそ
ko: 환영합니다

source: Nickname
es: Apodo
ja: ニックネーム
ko: 닉네임

# enterNickname
source: Please enter your nickname
es: Por favor ingrese su apodo
ja: ニックネームを入力してください
ko: 닉네임을 입력해주세요

# nicknameHint
source: Enter your nickname...
es: Ingrese su apodo...
ja: ニックネームを入力...
ko: 닉네임 입력...

source: Emergency Contact Setup
es: Configuración de Contactos de Emergencia
ja: 緊急連絡先の設定
ko: 비상 연락처 설정

# addContactPrompt
source: Please add emergency contacts for safety purposes.
es: Por favor agregue contactos de emergencia por seguridad.
ja: 安全のため緊急連絡先を追加してください。
ko: 안전을 위해 비상 연락처를 추가해주세요.

source: Contact Name
es: Nombre del Contacto
ja: 連絡先名
ko: 연락처 이름

# contactNameHint
source: Enter contact name...
es: Ingrese nombre del contacto...
ja: 連絡先名を入力...
ko: 연락처 이름 입력...

# contactPhone
source: Phone Number
es: Número de Teléfono
ja: 電話番号
ko: 전화번호

# contactPhoneHint
source: Enter phone number...
es: Ingrese número de teléfono...
ja: 電話番号を入力...
ko: 전화번호 입력...

source: Add Contact
es: Agregar Contacto
ja: 連絡先を追加
ko: 연락처 추가

# removeContact
source: Remove
es: Eliminar
ja: 削除
ko: 삭제

source: Complete Setup
es: Completar Configuración
ja: 設定完了
ko: 설정 완료

source: Skip
es: Saltar
ja: スキップ
ko: 건너뛰기

# continueButton
source: Continue
es: Continuar
ja: 続行
ko: 계속

source: Finish
es: Finalizar
ja: 完了
ko: 완료

source: Location permission granted
es: Permiso de ubicación concedido
ja: 位置情報は許可済み
ko: 위치 권한이 허용되었습니다

source: Allow Location Permission
es: Permitir Permiso de Ubicación
ja: 位置情報を許可する
ko: 위치 권한 허용

source: Notification permission granted
es: Permiso de notificaciones concedido
ja: 通知は許可済み
ko: 알림 권한이 허용되었습니다

source: Allow Notification Permission
es: Permitir Permiso de Notificaciones
ja: 通知を許可する
ko: 알림 권한 허용

source: Back to Home
es: Volver al Inicio
ja: ホームに戻る
ko: 홈으로 돌아가기

source: Not set
es: No configurado
ja: 未設定
ko: 설정되지 않음

source: Waiting for response
es: Esperando respuesta
ja: 回答待ち
ko: 응답 대기 중

source: Tap to confirm
es: Toca para confirmar
ja: タップで確認
ko: 탭하여 확인

source: Ask question
es: Hacer pregunta
ja: 質問可能
ko: 질문하기

source: ⚠️ Emergency action required
es: ⚠️ Se requiere acción de emergencia
ja: ⚠️ 緊急行動が必要です
ko: ⚠️ 긴급 조치가 필요합니다

# evacuationInfo
source: 🚨 Evacuation information
es: 🚨 Información de evacuación
ja: 🚨 避難情報
ko: 🚨 대피 정보

# shelterInfo
source: 🏠 Shelter information
es: 🏠 Información de refugio
ja: 🏠 避難所情報
ko: 🏠 대피소 정보

source: 🚨 Emergency alert
es: 🚨 Alerta de emergencia
ja: 🚨 緊急アラート
ko: 🚨 긴급 경보

source: ✅ Safety confirmation
es: ✅ Confirmación de seguridad
ja: ✅ 安否確認
ko: ✅ 안전 확인

# hazardMapInfo
source: 🗺️ Hazard map information
es: 🗺️ Información del mapa de peligros
ja: 🗺️ ハザードマップ情報
ko: 🗺️ 위험 지도 정보

# disasterLatestInfo
source: 📡 Latest disaster information
es: 📡 Información más reciente sobre desastres
ja: 📡 最新災害情報
ko: 📡 최신 재해 정보

# disasterRelatedInfo
source: 🌀 Disaster-related information
es: 🌀 Información relacionada con desastres
ja: 🌀 災害関連情報
ko: 🌀 재해 관련 정보

source: Question sent
es: Pregunta enviada
ja: 質問を送信しました
ko: 질문을 보냈습니다

source: Notification confirmed
es: Notificación confirmada
ja: 通知を確認しました
ko: 알림을 확인했습니다

source: Loading...
es: Cargando...
ja: 読み込み中...
ko: 로딩 중...

# timelineEmpty
source: Timeline is empty
es: La línea de tiempo está vacía
ja: タイムラインは空です
ko: 타임라인이 비어 있습니다

source: Loading timeline...
es: Cargando línea de tiempo...
ja: タイムラインを読み込み中...
ko: 타임라인 로딩 중...

# gettingLatestInfo
source: Getting latest SafeBeee information
es: Obteniendo la información más reciente de SafeBeee
ja: SafeBeeeの最新情報を取得中
ko: SafeBeee의 최신 정보를 가져오는 중

# infoWillAppearSoon
source: Information will appear soon. Please wait.
es: La información aparecerá pronto. Por favor espera.
ja: 間もなく情報が表示されます。お待ちください。
ko: 곧 정보가 표시됩니다. 잠시 기다려 주세요.

source: User Nickname
es: Apodo del Usuario
ja: ユーザーニックネーム
ko: 사용자 닉네임

source: Emergency Contacts List
es: Lista de Contactos de Emergencia
ja: 緊急連絡先一覧
ko: 비상 연락처 목록

# noEmergencyContacts
source: No emergency contacts registered
es: No hay contactos de emergencia registrados
ja: 緊急連絡先が登録されていません
ko: 등록된 비상 연락처가 없습니다

source: contacts
es: contactos
ja: 件
ko: 개

source: contact
es: contacto
ja: 件
ko: 개

source: Reset app to initial state
es: Restablecer aplicación al estado inicial
ja: アプリを初期状態にリセット
ko: 앱을 초기 상태로 재설정

source: Confirmation
es: Confirmación
ja: 確認
ko: 확인

# resetConfirmationMessage
source: All settings and data will be deleted and returned to initial state. Are you sure?
es: Toda la configuración y datos serán eliminados y se volverá al estado inicial. ¿Está seguro?
ja: すべての設定とデータを削除して初期状態に戻します。よろしいですか？
ko: 모든 설정과 데이터가 삭제되고 초기 상태로 돌아갑니다. 확실하신가요?

source: Reset
es: Restablecer
ja: リセット
ko: 재설정

source: Edit Emergency Contact
es: Editar Contacto de Emergencia
ja: 緊急連絡先を編集
ko: 비상 연락처 편집

# deleteEmergencyContactConfirmation
source: Are you sure you want to delete this emergency contact?
es: ¿Está seguro de que desea eliminar este contacto de emergencia?
ja: この緊急連絡先を削除しますか？
ko: 이 비상 연락처를 삭제하시겠습니까?

source: Delete
es: Eliminar
ja: 削除
ko: 삭제

source: GPS Enabled
es: GPS Habilitado
ja: GPS有効
ko: GPS 활성화

source: GPS Disabled
es: GPS Deshabilitado
ja: GPS無効
ko: GPS 비활성화

# gpsPermissionDenied
source: Permission Denied
ja: 許可なし

source: Mobile
es: Móvil
ja: モバイル
ko: 모바일

source: Ethernet
ja: 有線
ko: 이더넷

source: Offline
es: Sin conexión
ja: オフライン
ko: 오프라인

source: Emergency SMS
es: SMS de emergencia
ja: 緊急SMS
ko: 긴급 SMS

# sendToAllContacts
source: Send to all contacts ({count})
es: Enviar a todos
ja: 全員に送信 ({count}名)
ko: 전체 전송

source: Select Individually
es: Seleccionar individualmente
ja: 個別に選択
ko: 개별 선택

# smsSafetyMessage
source: [SafeBeee] I am safe and in a secure location.
es: [SafeBeee] Estoy a salvo y en un lugar seguro.
ja: [SafeBeee] 私は無事で安全な場所にいます。
ko: [SafeBeee] 저는 안전하며 안전한 장소에 있습니다.

# smsTemplateRecommended
source: [SafeBeee] I am safe and secure.
es: [SafeBeee] Estoy bien y a salvo.
ja: [SafeBeee] 私は無事です。
ko: [SafeBeee] 저는 안전합니다.

# smsTemplateDetailed
source: [SafeBeee] I am safe and in a secure location. Please don't worry about me.
es: [SafeBeee] Estoy bien y en un lugar seguro. No se preocupen por mí.
ja: [SafeBeee] 私は無事で、安全な場所にいます。心配しないでください。
ko: [SafeBeee] 저는 안전하며 안전한 장소에 있습니다. 걱정하지 마세요.

# smsTemplateCheckIn
source: [SafeBeee] Regular check-in. I am doing well.
es: [SafeBeee] Contacto regular. Me encuentro bien.
ja: [SafeBeee] 定期連絡です。私は元気です。
ko: [SafeBeee] 정기 연락입니다. 저는 잘 지내고 있습니다.

# smsTemplateRecommendedWithLocation
source: [SafeBeee] I am safe and secure. Current location: {location}
es: [SafeBeee] Estoy bien y a salvo. Ubicación actual: {location}
ja: [SafeBeee] 私は無事です。現在地: {location}
ko: [SafeBeee] 저는 안전합니다. 현재 위치: {location}

source: SMS app opened
es: Aplicación de SMS abierta
ja: SMSアプリを開きました
ko: SMS 앱이 열렸습니다

source: SMS Sent
es: SMS enviado
ja: SMS送信完了
ko: SMS가 전송되었습니다

# smsFailedToOpen
source: Failed to open SMS app
es: No se pudo abrir la aplicación de SMS
ja: SMSアプリを開けませんでした
ko: SMS 앱을 열 수 없습니다

# recipientCount
source: {count} recipients
es: {count} destinatarios
ja: {count}名
ko: {count}명

source: Open Hazard Map
es: Abrir mapa de riesgos
ja: ハザードマップを開く
ko: 위험 지도 열기

# externalSiteWarning
source: External site will open
es: Se abrirá un sitio externo
ja: 外部サイトが開きます
ko: 외부 사이트가 열립니다

source: Hazard Map URL
es: URL del mapa de riesgos
ja: ハザードマップURL
ko: 위험 지도 URL

source: Open in Browser
es: Abrir en navegador
ja: ブラウザで開く
ko: 브라우저에서 열기

source: Close
es: Cerrar
ja: 閉じる
ko: 닫기

source: Send Complete
es: Envío completo
ja: 送信完了
ko: 전송 완료

source: SMS Prepared
es: SMS preparado
ja: SMS送信準備完了
ko: SMS 준비 완료

source: Copied to clipboard
es: Copiado al portapapeles
ja: クリップボードにコピーしました
ko: 클립보드에 복사됨

source: Recipient
es: Destinatario
ja: 宛先
ko: 수신자

source: Message
es: Mensaje
ja: メッセージ
ko: 메시지

# smsInstructions
source: Instructions:
es: Instrucciones:
ja: 手順:
ko: 순서:

source: Open SMS App
es: 1. Abrir aplicación de SMS
ja: SMSアプリを開く
ko: 1. SMS 앱 열기

# enterPhoneNumber
source: 2. Enter or select phone number
es: 2. Ingrese o seleccione el número de teléfono
ja: 2. 電話番号を入力または選択
ko: 2. 전화번호 입력 또는 선택

# pasteAndSend
source: 3. Paste message and send
es: 3. Pegue el mensaje y envíe
ja: 3. メッセージを貼り付けて送信
ko: 3. 메시지 붙여넣기 후 전송

# smsAppOpenedButton
source: SMS app opened
es: Aplicación de SMS abierta
ja: SMSアプリを開きました
ko: SMS 앱이 열렸습니다

# smsAppOpenedMessage
source: SMS app opened for {name} ({phone})
es: Aplicación de SMS abierta para {name} ({phone})
ja: {name} ({phone}) 宛にSMSアプリを開きました
ko: {name} ({phone})님께 SMS 앱을 열었습니다

# smsSendInstructions
source: Please press 'Send Complete' button after sending the SMS
es: Por favor presione el botón 'Envío completo' después de enviar el SMS
ja: SMSを送信したら「送信完了」ボタンを押してください
ko: SMS를 보낸 후 '전송 완료' 버튼을 눌러주세요

# smsManualInstructions
source: Manual SMS sending instructions:
es: Instrucciones para enviar SMS manualmente:
ja: 手動でSMSを送信する方法:
ko: 수동으로 SMS 보내는 방법:

# smsCopyButtonInstruction
source: 1. Press 'Copy' button to copy contact and message
es: 1. Presione el botón 'Copiar' para copiar contacto y mensaje
ja: 1. 「コピー」ボタンで連絡先とメッセージをコピー
ko: 1. '복사' 버튼으로 연락처와 메시지 복사

# smsOpenAppInstruction
source: 2. Manually open SMS app
es: 2. Abra manualmente la aplicación de SMS
ja: 2. SMSアプリを手動で開く
ko: 2. SMS 앱을 수동으로 열기

# smsPasteAndSendInstruction
source: 3. Paste phone number and message, then send
es: 3. Pegue el número de teléfono y el mensaje, luego envíe
ja: 3. 電話番号とメッセージを貼り付けて送信
ko: 3. 전화번호와 메시지를 붙여넣고 전송

# smsFailedToOpenApp
source: Failed to open SMS app automatically
es: No se pudo abrir la aplicación de SMS automáticamente
ja: SMSアプリを自動で開くことができませんでした
ko: SMS 앱을 자동으로 열 수 없습니다

source: Error details:
es: Detalles del error:
ja: エラー詳細:
ko: 오류 세부사항:

source: Send to:
es: Enviar a:
ja: 送信先:
ko: 보낼 곳:

source: Message content:
es: Contenido del mensaje:
ja: メッセージ内容:
ko: 메시지 내용:

# allContactsSmsSuccess
source: SMS sent to {count} contacts
es: SMS enviado a {count} contactos
ja: {count}名にSMSを送信しました
ko: {count}명에게 SMS를 보냈습니다

# allContactsSmsFailed
source: Failed to send SMS to all contacts
es: Error al enviar SMS a todos los contactos
ja: 全ての連絡先へのSMS送信に失敗しました
ko: 모든 연락처로 SMS 전송에 실패했습니다

# smsFailedWithError
source: Failed to send SMS: {error}
es: Error al enviar SMS: {error}
ja: SMSの送信に失敗しました: {error}
ko: SMS 전송 실패: {error}

source: Edit Message
es: Editar mensaje
ja: メッセージを編集
ko: 메시지 편집

source: Copy
es: Copiar
ja: コピー
ko: 복사

# failedToOpenHazardMap
source: Failed to open hazard map: {error}
es: Error al abrir el mapa de riesgos: {error}
ja: ハザードマップを開けませんでした: {error}
ko: 위험 지도를 열 수 없습니다: {error}

# hazardMapOpened
source: Hazard map opened successfully
es: Mapa de riesgos abierto exitosamente
ja: ハザードマップを開きました
ko: 위험 지도가 성공적으로 열렸습니다

source: Hazard Map Portal Site
es: Sitio Portal del Mapa de Riesgos
ja: ハザードマップポータルサイト
ko: 위험 지도 포털 사이트

# checkDisasterRiskInfo
source: Check nationwide disaster risk information
es: Verificar información de riesgo de desastres a nivel nacional
ja: 全国の災害リスク情報を確認
ko: 전국 재해 위험 정보 확인

# checkVariousSettings
source: Various settings
es: Varias configuraciones
ja: 各種設定など
ko: 각종 설정 등

source: Add
ja: 追加

source: Edit
ja: 編集

source: Loading settings...
ja: 設定を読み込み中...

source: Heartbeat Interval
ja: ハートビート間隔

source: Normal time
ja: 平常時

source: Disaster time
ja: 災害時

source: minutes
ja: 分

source: seconds
ja: 秒

source: Debug Features
ja: デバッグ機能

source: Current System Status
ja: 現在のシステム状態

source: Operation Mode
ja: 動作モード

source: Emergency Mode
ja: 緊急モード

source: Normal Mode
ja: 平常モード

source: Connection Status
ja: 接続状態

source: Location Status
ja: 位置情報

source: Enabled
ja: 有効

source: Disabled
ja: 無効

source: Battery
ja: バッテリー

source: Charging
ja: 充電中

# emergencyModeActive
source: Emergency mode active: Heartbeat interval shortened
ja: 緊急モード中：ハートビート間隔が短縮されています

source: Test Alert
ja: テストアラート発報

source: Switch to Normal Mode
ja: 平常モードに戻す

source: Switch to Emergency Mode
ja: 緊急モードに切り替え

source: Emergency Mode Toggle
ja: 緊急モード切り替え

source: Show Suggestion History
ja: 提案履歴を表示

# completeReset
source: Complete Reset (Debug Only)
ja: 完全削除（デバッグ専用）

# completeResetWarning
source: All data, settings, history, contacts, and Firebase will be completely deleted
ja: 全データ・設定・履歴・連絡先・Firebaseを完全削除

source: Show Interval Settings
ja: 間隔設定を表示

# debugNote
source: Debug features are only visible when TEST_MODE=true in .env
ja: ※ デバッグ機能は.envでTEST_MODE=trueの場合のみ表示されます

# suggestionHistory
source: Suggestion History (Debug)
ja: 提案履歴（デバッグ用）

source: Current Type-based History
ja: 現在のタイプベース履歴

# typeBasedHistoryEmpty
source: No type-based history
ja: タイプベースの履歴はありません

source: Legacy ID-based History
ja: 旧いIDベース履歴

# idBasedHistoryEmpty
source: No ID-based history
ja: IDベースの履歴はありません

# andMore
source: and {count} more
ja: あと{count}件

# debugInfo
source: Debug Information
ja: デバッグ情報

# historyNote
source: ・ Type-based is the current history management method ・ ID-based is the old method (deprecated) ・ Clear history if suggestions are not displayed
ja: ・ タイプベースは現在使用中の履歴管理方式 ・ IDベースは旧い方式（非推奨） ・ 提案が表示されない場合は履歴をクリア

source: Select Test Alert Type
ja: テストアラート種別を選択

source: Earthquake
ja: 地震

# earthquakeTest
source: Emergency Earthquake Alert Test
ja: 緊急地震速報のテスト

source: Tsunami
ja: 津波

# tsunamiTest
source: Tsunami Warning Test
ja: 津波警報のテスト

source: Heavy Rain
ja: 豪雨

# heavyRainTest
source: Heavy Rain Special Warning Test
ja: 大雨特別警報のテスト

source: Fire
ja: 火災

# fireTest
source: Fire Warning Test
ja: 火災警報のテスト

# forceResetEmergency
source: Force Emergency Mode Reset
ja: 緊急モード強制解除

# forceResetEmergencyDesc
source: Forcefully reset emergency mode (debug only)
ja: 緊急モードを強制的に解除（デバッグ用）

# forceResetConfirm
source: Force Emergency Mode Reset
ja: 緊急モード強制解除

# forceResetMessage
source: Are you sure you want to forcefully reset emergency mode? ※This operation is valid for 5 minutes and should only be used for debugging purposes.
ja: 緊急モードを強制的に解除しますか？ ※この操作は5分間有効で、デバッグ目的でのみ使用してください。

# performReset
source: Reset
ja: 解除する

source: Resetting emergency mode...
ja: 緊急モードを解除中...

# emergencyModeResetSuccess
source: Emergency mode reset successful
ja: 緊急モード解除成功

# emergencyModeResetFailed
source: Failed to reset emergency mode
ja: 緊急モード解除に失敗しました

source: Triggering alert...
ja: アラートを発報中...

# alertTriggerSuccess
source: Alert triggered successfully! {message}
ja: アラート発報成功！ {message}

# alertTriggerFailed
source: Failed to trigger alert: {error}
ja: アラート発報失敗: {error}

source: Debug Alert (Test)
ja: 緊急アラート（テスト）

# debugAlertDescription
source: This is a test alert triggered from debug features.
ja: これはデバッグ機能から発報されたテストアラートです。

# emergencyModeToggleConfirm
source: Emergency Mode Toggle
ja: 緊急モード切り替え

# emergencyModeToggleMessage
source: Execute debug emergency mode toggle? ・normal → emergency: Enable emergency mode ・emergency → normal: Disable emergency mode ※Heartbeat interval will be automatically adjusted
ja: デバッグ用の緊急モード切り替えを実行しますか？ ・normal → emergency: 緊急モード有効化 ・emergency → normal: 緊急モード解除 ※ハートビート間隔も自動調整されます

# performToggle
source: Toggle
ja: 切り替え実行

source: Switched to emergency mode
ja: 緊急モードに切り替えました

source: Switched to normal mode
ja: 平常モードに切り替えました

# emergencyModeToggleFailed
source: Failed to toggle emergency mode: {error}
ja: 緊急モード切り替えに失敗しました: {error}

source: Complete App Reset
ja: 完全アプリリセット

# completeResetConfirm
source: Complete Debug Reset
ja: 完全デバッグリセット

# completeResetConfirmMessage
source: Execute complete debug reset?
ja: 完全デバッグリセットを実行しますか？

# deleteTargets
source: Delete Targets (Irreversible):
ja: 削除対象（取り消し不可）:

# deleteTargetsList
source: 🗑️ All local settings and history 🗑️ Firebase data (complete deletion) 🗑️ Suggestion history (frontend and backend) 🗑️ Disaster mode and emergency mode status 🗑️ Emergency contacts 🗑️ Chat history and timeline ⚠️ Debug-only feature
ja: 🗑️ 全ローカル設定・履歴 🗑️ Firebaseデータ（完全削除） 🗑️ 提案履歴（フロントエンド・バックエンド） 🗑️ 災害モード・緊急モード状態 🗑️ 緊急連絡先 🗑️ チャット履歴・タイムライン ⚠️ デバッグ専用機能です

# performCompleteReset
source: Complete Reset
ja: 完全リセット

source: Executing complete reset...
ja: 完全リセット実行中...

# initializingData
source: Initializing Firebase, local data, timeline history, and disaster mode
ja: Firebase・ローカルデータ・タイムライン履歴・災害モードを初期化しています

# completeResetSuccess
source: Complete reset successful. Moving to onboarding...
ja: 完全リセットが完了しました。オンボーディングに移動します...

# completeResetFailed
source: Complete reset failed: {error}
ja: 完全リセットに失敗しました: {error}

source: System Interval Settings
ja: システム間隔設定

source: Current Mode
ja: 現在のモード

source: Disaster Monitoring Interval
ja: 災害監視間隔

# disasterMonitoringExplanation
source: Disaster Monitoring Interval?
ja: 災害監視間隔とは？

# disasterMonitoringDescription
source: Frequency of retrieving disaster information from JMA (Japan Meteorological Agency) and other sources. Automatically checks for earthquakes, tsunamis, heavy rain, and other disasters, and notifies users in affected areas when new disasters are detected.
ja: JMA（気象庁）等から災害情報を取得する頻度です。 地震、津波、豪雨などの災害発生を自動的にチェックし、 新しい災害が検出されると該当地域のユーザーに通知します。

source: Test Mode Settings
ja: テストモード設定

source: Normal Mode Settings
ja: 平常時の設定

source: Emergency Mode Settings
ja: 災害緊急時の設定

source: Interval Descriptions:
ja: 各間隔の説明:

source: Disaster Monitoring
ja: 災害監視

source: News Collection
ja: ニュース収集

source: Periodic Data Collection
ja: 定期データ収集

source: Heartbeat
ja: ハートビート

source: Critical Alert
ja: 重大アラート時

source: Suggestion Cooldown
ja: 提案クールダウン

source: Heartbeat Interval Settings
ja: ハートビート間隔設定

# heartbeatIntervalDescription
source: Set the interval for sending device status to the server. Shorter intervals consume more battery.
ja: デバイスの状態をサーバーに送信する間隔を設定します。 短い間隔ほどバッテリーを消費します。

# normalTimeLabel
source: Normal time:
ja: 平常時:

# disasterTimeLabel
source: Disaster time:
ja: 災害時:

# heartbeatNote
source: ※ Automatically switches to shorter interval during disasters
ja: ※ 災害時は自動的に短い間隔に切り替わります

source: Heartbeat interval updated
ja: ハートビート間隔を更新しました

# settingsSaveFailed
source: Failed to save settings: {error}
ja: 設定の保存に失敗しました: {error}

# fetchingIntervalConfig
source: Fetching interval configuration...
ja: 間隔設定を取得中...

# intervalConfigFetchFailed
source: Failed to fetch interval configuration: {error}
ja: 間隔設定の取得に失敗しました: {error}

source: 🚨 Emergency Earthquake Alert (Test)
ja: 🚨 緊急地震速報（テスト）

source: 🌊 Tsunami Warning (Test)
ja: 🌊 津波警報（テスト）

source: 🌧️ Heavy Rain Special Warning (Test)
ja: 🌧️ 大雨特別警報（テスト）

source: 🔥 Fire Warning (Test)
ja: 🔥 火災警報（テスト）

source: 🚨 Emergency Alert (Test)
ja: 🚨 緊急アラート（テスト）

# earthquakeAlertTestDescription
source: This is a test emergency earthquake alert. Be prepared for strong shaking. (Test)
ja: これはテスト用の緊急地震速報です。強い揺れに警戒してください。（テスト）

# tsunamiAlertTestDescription
source: This is a test tsunami warning. Evacuate to higher ground. (Test)
ja: これはテスト用の津波警報です。高台に避難してください。（テスト）

# heavyRainAlertTestDescription
source: This is a test heavy rain special warning. Take life-saving actions. (Test)
ja: これはテスト用の大雨特別警報です。命を守る行動をとってください。（テスト）

# fireAlertTestDescription
source: This is a test fire warning. Evacuate immediately. (Test)
ja: これはテスト用の火災警報です。速やかに避難してください。（テスト）

# debugAlertTestDescription
source: This is a test alert triggered from debug features.
ja: これはデバッグ機能から発報されたテストアラートです。

# checkNationwideDisasterInfo
source: Check nationwide disaster information
es: Verificar información de desastres a nivel nacional
ja: 全国災害情報を確認
ko: 전국 재해 정보 확인

source: View hazard map
es: Ver mapa de riesgos
ja: ハザードマップを確認
ko: 위험 지도 확인

source: Send emergency SMS
es: Enviar SMS de emergencia
ja: 緊急SMS送信
ko: 긴급 SMS 전송

# checkSafetyInfo
source: Check safety information
es: Verificar información de seguridad
ja: 安全情報を確認
ko: 안전 정보 확인

source: Evacuation guidance
es: Guía de evacuación
ja: 避難案内
ko: 대피 안내

# emergencyContactInfo
source: Emergency contact information
es: Información de contactos de emergencia
ja: 緊急連絡先情報
ko: 비상 연락처 정보

# smsSelectedSentSuccess
source: SMS sent successfully to {successCount} out of {totalCount} selected contacts
ja: 選択した{totalCount}名中{successCount}名にSMSを送信しました

# selectedContactsSmsFailed
source: Failed to send SMS to selected contacts
ja: 選択した連絡先へのSMS送信に失敗しました

source: Send safety confirmation message
ja: 安全確認のメッセージを送信

# sendMessage
source: Message to send
ja: 送信メッセージ

source: Individual SMS Mode
ja: 個別SMS送信

source: Enter message
ja: メッセージを入力

source: Select Recipients
ja: 送信先を選択

source: Select All
ja: すべて選択

source: Deselect All
ja: 選択解除

# sendToSelected
source: Send to {count} selected
ja: 選択した{count}名に送信

# emergencyDefaultOverview
source: An emergency situation has occurred. Stay calm, assess the situation, and take appropriate safety actions. Pay attention to the latest information and prepare for evacuation if necessary.
ja: 緊急事態が発生しています。落ち着いて状況を確認し、適切な安全行動を取ってください。最新の情報に注意し、必要に応じて避難の準備を行ってください。
